Repository: wp-plugins/mk-simple-backups
Catalog: languages/*-simple-backups-*.po
Languages: de_de

source: Blank File %s created
de_de: Leere Datei %s erstellt

source: Blank File could not be created
de_de: Leere Datei konnte nicht erstellt werden

source: Files in the backup directory were deleted
de_de: Dateien im Backup Verzeichnis gelöscht

source: Some files could not be removed by the script. Check File-Permissions or delete the files manually.
de_de: Einige Dateien konnten vom Script nicht entfernt werden. Berechtigungen prüfen und allenfalls manuell entfernen.

source: Database
de_de: Datenbank

source: Active Theme
de_de: Aktives Theme

source: List of Plugins
de_de: Pluginliste

source: Uploads (file based)
de_de: Uploads (Verzeichnis-basierend)

source: Uploads (db based)
de_de: Uploads (DB-basierend)

source: Complete Backup failed upon attempting to backup %s
de_de: Backup gescheitert bei %s

source: Backup %s created (containing %s)
de_de: Backup %s erstellt (enthält %s)

source: Backup %s created (complete)
de_de: Backup %s erstellt (komplett)

source: ZIP Archive %s failed, partial Backups exist
de_de: ZIP Archiv %s konnte nicht erstellt werden, einzelne Backups sind erstellt

source: One file
de_de: Eine Datei

source: %s files
de_de: %s Dateien

source: Important
de_de: Wichtig

source: Since the sql-dump-file will include usernames for your wp-installation, make sure to remove it after downloading the backup.
de_de: Da das SQL-Dump Benutzernamen enthält, sollten Backup Dateien nach dem Download gelöscht werden.

source: Delete files in Backup directory.
de_de: Dateien im Backup Verzeichnis löschen.

source: Currently no backups stored on the server
de_de: Momentan keine Backups auf dem Server

source: Create Backup
de_de: Backup erstellen

source: a <em>list</em> of currently active Plugins
de_de: eine <em>Liste</em> der aktivierten Plugins

source: All files within %s
de_de: Alle Dateien in %s

source: Attachments from DB (post_type: attachment)
de_de: Backup Attachments aus der DB (post_type: attachment)

source: create Backup
de_de: Backup erstellen

source: Backup directory
de_de: Backup Verzeichnis

source: What's going on?
de_de: Was passiert im Hintergrund?

source: The Theme Backup will create a ZIP Archive containing all files within the directory of your current active theme. If the active theme is a child-theme, the backup will detect this and include all files from the parent theme.
de_de: Das Theme Backup legt ein ZIP Archiv an, welches alle Dateien aus dem Verzeichnis des aktiven Themes beinhaltet. Falls es sich bei dem aktiven Theme um ein Child-Theme handelt, werden zusätzlich alle Dateien des Parent-Themes zum ZIP hinzugefügt.

source: The DB Backup creates an SQL Dump that can be used to restore your Database with all information contained. To restore the Database, you'll have to use a plugin like Adminer. Since many shared hostings don't support system() by default, the SQL Dump can also be generated by the script (Additional Library: Shuttle Export from 2createStudio). It will dump all tables in the Database used by Wordpress. This includes custom tables created by plugins or your theme.
de_de: Das Datenbank Backup erstellt einen SQL Dump der zum wiederherstellen der Datenbank und der enthaltenen Informationen dient. Um die ein solches SQL Dump wiederherzustellen, ist ein zusätzliches Plugin wie Adminer nötig. Da bei vielen Shared Hostings die Funktion system() standardmässig deaktiviert ist, kann das Plugin auch einen individuellen SQL Dump erstellen (Zusätzliches Script: Shuttle Export von 2createStudio). Das Plugin speichert alle in der Datenbank verwendeten Tabellen. So werden auch von Plugins or Themes erstellte Zusatztabellen im Backup eingeschlossen.

source: This plugin will not back up your Plugins. This happens for the following reasons: a) They outdate quickly, making a backed up Version easily obsolete. b) There are huge Plugins out there, which would slow down Backups considerably. And c) Plugins must not include custom code and therefore can easily be re-downloaded in current or older Versions from the repository. This plugin simply generates a convenient plain-text list of currently active Plugins with their respective Version-Number and the Plugin-URI.
de_de: Dieses Plugin schliesst keine Plugins ins Backup ein. Dies aus folgenden Gründen: a) Plugins werden häufig aktualisiert, Backups von älteren Plugins sind daher schnell überholt b) Infolge riesiger Plugins würden die Backups zusätzlich verlangsamt, c) da Plugins keinen eigenen Code enthalten dürfen, können sie einfach aus dem WP Plugin-Verzeichnis herunterladen werden (auch in älteren Versionen). Um diesen Vorgang zu erleichtern, generiert das Plugin auf Wunsch eine Liste der aktiven Plugins mit Versionsnummer und Plugin-URI.

source: The file-based Upload Backup will scan the whole Upload Directory (including subfolders) and create a ZIP Archive containing all files found. If there are many files in the upload directory, the script might time out. The DB based Upload Backup will fetch Attachments from the DB and create a ZIP Archive with found files. In the DB approach, the thumbnails and scaled versions are not included, since they can be regenerated afterwards easily. By ommitting those files, the DB approach saves space and script execution time. The DB based approach can be incomplete when plugins create files in the upload directory that arent included in the DB as attachments. There are plugins that do this.
de_de: Das Dateibasierte Upload Backup sucht alle Dateien im Upload-Verzeichnis (inklusive Unterordner) und erstellt dann ein ZIP Archiv welches alle Dateien enthält. Wenn viele Dateien im Upload-Verzeichnis vorliegen, kann das Script die maximale Ausführung überschreiten. Das Datenbank-basierte Upload Backup sucht Attachments aus der Datenbank und erstellt ein ZIP Archiv mit den gefundenen Dateien. Hierbei werden zB. Thumbnails und skalierte Versionen der Bilder nicht berücksichtig, da diese im Nachhinein einfach neu generiert werden können. Durch das Aussparen dieser Dateien wird Speicherplatz und Script Ausführungszeit gespart. Jedoch werden auch Dateien vom Backup ausgeschlossen welche in der Datenbank nicht als Attachments gespeichert sind. Es gibt beispielsweise Galerie-Plugins welche ihr Dateien so speichern.

source: How long does it take?
de_de: Wie lange dauert es?

source: Depending on the amount of files and data, Backups can widely vary in size and time taken to create. The script attempts to increase maximum execution time for php scripts to allow larger Backups to be created. While a backup is being created, don't close your tab/browser and don't navigate to another page as that would cancel unfinished backups and may leave temporary files in the backup directory. If a complete Backup fails, you may want to try creating partial backups.
de_de: Je nach der Anzahl an Dateien und Informationen, kann die Grösse und Ausführungszeit für ein Backup variieren. Das Plugin versucht für die Backup Generierung die Maximale Ausführungszeit eines Scripts zu erhöhen. Während das Backup erstellt wird darf der Browser/das Tab nicht geschlossen werden, und es darf nicht von der Backup-Seite wegnavigiert werden. Andernfalls wird das Backup abgebrochen und können unvollständige Dateien im Backup-Verzeichnis zurückbleiben.

source: My Backup has failed, why?
de_de: Das Backup ist gescheitert, wieso?

source: Usually file-permissions are at fault if the plugins fails to create Backups. Use your FTP-Client to make sure writing permission on the Backup Directory (refer to the path displayed above) are set to writeable. If there's other problems, use the Plugin Page in the Plugin Repository to request support or patching.
de_de: Normalerweise sind die Dateiberechtigungen das Problem für fehlerhafte Backups. Verwende ein FTP Programm und die Schreibberechtigungen im Backup Verzeichnis zu prüfen. Falls es andere Probleme gibt, verwende bitte den Plugin Support Bereich auf der Plugin Seite im offiziellen Plugin-Verzeichnis von Wordpress.

source: Blank File
de_de: Leere Datei

source: test writing permissions
de_de: Schreibberechtigungen prüfen

source: create Blank File
de_de: Leere Datei erstellen

source: Backup directory could not be created: %s
de_de: Backup Verzeichnis konnte nicht erstellt werden: %s
